Update architecture diagrams
